Словарь/src/Catalogs/Слоги/Слоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Слоги</name>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьХираганой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьКатаканой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКатакана</name>
    <attributes>
      <name>Моджи</name>
      <type>
        <types>CatalogRef.Моджи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Словарь/src/Catalogs/Моджи/Моджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Моджи</name>
  <comment>1 символ</comment>
  <predefined>
    <items>
      <name>A</name>
      <description>A</description>
    </items>
    <items>
      <name>Ba</name>
      <description>Ba</description>
    </items>
    <items>
      <name>Be</name>
      <description>Be</description>
    </items>
    <items>
      <name>Bi</name>
      <description>Bi</description>
    </items>
    <items>
      <name>Bo</name>
      <description>Bo</description>
    </items>
    <items>
      <name>Bu</name>
      <description>Bu</description>
    </items>
    <items>
      <name>Chi</name>
      <description>Chi</description>
    </items>
    <items>
      <name>Da</name>
      <description>Da</description>
    </items>
    <items>
      <name>De</name>
      <description>De</description>
    </items>
    <items>
      <name>Do</name>
      <description>Do</description>
    </items>
    <items>
      <name>Dzu</name>
      <description>Dzu</description>
    </items>
    <items>
      <name>E</name>
      <description>E</description>
    </items>
    <items>
      <name>Fu</name>
      <description>Fu</description>
    </items>
    <items>
      <name>Ga</name>
      <description>Ga</description>
    </items>
    <items>
      <name>Ge</name>
      <description>Ge</description>
    </items>
    <items>
      <name>Gi</name>
      <description>Gi</description>
    </items>
    <items>
      <name>Go</name>
      <description>Go</description>
    </items>
    <items>
      <name>Gu</name>
      <description>Gu</description>
    </items>
    <items>
      <name>Ha</name>
      <description>Ha</description>
    </items>
    <items>
      <name>He</name>
      <description>He</description>
    </items>
    <items>
      <name>Hi</name>
      <description>Hi</description>
    </items>
    <items>
      <name>Ho</name>
      <description>Ho</description>
    </items>
    <items>
      <name>I</name>
      <description>I</description>
    </items>
    <items>
      <name>Dzi</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ji</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ka</name>
      <description>Ka</description>
    </items>
    <items>
      <name>Ke</name>
      <description>Ke</description>
    </items>
    <items>
      <name>Ki</name>
      <description>Ki</description>
    </items>
    <items>
      <name>Ko</name>
      <description>Ko</description>
    </items>
    <items>
      <name>Ku</name>
      <description>Ku</description>
    </items>
    <items>
      <name>Ma</name>
      <description>Ma</description>
    </items>
    <items>
      <name>Me</name>
      <description>Me</description>
    </items>
    <items>
      <name>Mi</name>
      <description>Mi</description>
    </items>
    <items>
      <name>Mo</name>
      <description>Mo</description>
    </items>
    <items>
      <name>Mu</name>
      <description>Mu</description>
    </items>
    <items>
      <name>N</name>
      <description>N</description>
    </items>
    <items>
      <name>Na</name>
      <description>Na</description>
    </items>
    <items>
      <name>Ne</name>
      <description>Ne</description>
    </items>
    <items>
      <name>Ni</name>
      <description>Ni</description>
    </items>
    <items>
      <name>No</name>
      <description>No</description>
    </items>
    <items>
      <name>Nu</name>
      <description>Nu</description>
    </items>
    <items>
      <name>O</name>
      <description>O</description>
    </items>
    <items>
      <name>Pa</name>
      <description>Pa</description>
    </items>
    <items>
      <name>Pe</name>
      <description>Pe</description>
    </items>
    <items>
      <name>Pi</name>
      <description>Pi</description>
    </items>
    <items>
      <name>Po</name>
      <description>Po</description>
    </items>
    <items>
      <name>Pu</name>
      <description>Pu</description>
    </items>
    <items>
      <name>Ra</name>
      <description>Ra</description>
    </items>
    <items>
      <name>Re</name>
      <description>Re</description>
    </items>
    <items>
      <name>Ri</name>
      <description>Ri</description>
    </items>
    <items>
      <name>Ro</name>
      <description>Ro</description>
    </items>
    <items>
      <name>Ru</name>
      <description>Ru</description>
    </items>
    <items>
      <name>Sa</name>
      <description>Sa</description>
    </items>
    <items>
      <name>Se</name>
      <description>Se</description>
    </items>
    <items>
      <name>Shi</name>
      <description>Shi</description>
    </items>
    <items>
      <name>So</name>
      <description>So</description>
    </items>
    <items>
      <name>Su</name>
      <description>Su</description>
    </items>
    <items>
      <name>Ta</name>
      <description>Ta</description>
    </items>
    <items>
      <name>Te</name>
      <description>Te</description>
    </items>
    <items>
      <name>To</name>
      <description>To</description>
    </items>
    <items>
      <name>Tsu</name>
      <description>Tsu</description>
    </items>
    <items>
      <name>U</name>
      <description>U</description>
    </items>
    <items>
      <name>Wa</name>
      <description>Wa</description>
    </items>
    <items>
      <name>Wo</name>
      <description>Wo</description>
    </items>
    <items>
      <name>Ya</name>
      <description>Ya</description>
    </items>
    <items>
      <name>Yo</name>
      <description>Yo</description>
    </items>
    <items>
      <name>Yu</name>
      <description>Yu</description>
    </items>
    <items>
      <name>Za</name>
      <description>Za</description>
    </items>
    <items>
      <name>Ze</name>
      <description>Ze</description>
    </items>
    <items>
      <name>Zo</name>
      <description>Zo</description>
    </items>
    <items>
      <name>Zu</name>
      <description>Zu</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКатакана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМиниСимвол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Словарь/src/CommonModules/АзбукаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Преобразует текст, написанный хираганой, в катакану.
//
// Параметры:
//   Хирагана - Строка - текст для преобразования
//
// Возвращаемое значение:
//   Строка - результат преобразования в катакану
Функция Катакана(Хирагана) Экспорт
	
	Возврат АзбукаПовтИсп.Катакана(Хирагана);
	
КонецФункции

// Конвертирует текст, написанный катаканой, в хирагану.
//
// Параметры:
//   Катакана - Строка - Строка, содержащая символы катаканы для преобразования.
//
// Возвращаемое значение:
//   Строка - Строка, содержащая эквивалентные символы хираганы.
Функция Хирагана(Катакана) Экспорт
	
	Возврат АзбукаПовтИсп.Хирагана(Катакана);
	
КонецФункции

// Возвращает соответствие символов ромаджи символам кириллицы.
//
// Возвращаемое значение:
//   Соответствие из Строка - Строка - для перевода ромаджи в кириллицу.
Функция СоответствиеРомаджиКириллицы() Экспорт
	
	Возврат АзбукаПовтИсп.СоответствиеРомаджиКириллицы();
	
КонецФункции

// Возвращает соответствие ромаджи (японской азбуки) символам Юникода.
//
// Возвращаемое значение:
//   Соответствие из Строка - Ключ: строка с ромаджи, значение: строка с символом Юникода.
Функция СоответствиеРомаджиЮникоду() Экспорт
	
	Возврат АзбукаПовтИсп.СоответствиеРомаджиЮникоду();
	
КонецФункции

// Возвращает соответствие ромаджи слогам азбуки.
//
// Возвращаемое значение:
//   Соответствие из Строка - Ключ содержит строку с ромаджи, значение - данные слога
Функция СоответствиеРомаджиДаннымСлогов() Экспорт
	
	Возврат АзбукаПовтИсп.СоответствиеРомаджиДаннымСлогов();
	
КонецФункции

// Возвращает соответствие между слогами с двойными гласными и их представлением в ромаджи.
//
// Возвращаемое значение:
//   Соответствие из Строка - ключ - слог с двойными гласными (Строка), значение - представление в ромаджи (Строка)
Функция СоответствиеРомаджиДаннымСлоговСДвойнымиГласными() Экспорт
	
	Возврат АзбукаПовтИсп.СоответствиеРомаджиДаннымСлоговСДвойнымиГласными();
	
КонецФункции

// Формирует текст запроса для получения данных токенов, связанных с заданными слогами.
//
// Возвращаемое значение:
//   Строка - текст запроса для выборки данных токенов.
Функция ТекстЗапросаДанныеТокенов() Экспорт
	
	Возврат 
	"ВЫБРАТЬ
	|	СлогиСостав.НомерСтроки КАК НомерСтроки,
	|	СлогиСостав.Ссылка КАК Слог,
	|	Слоги.Наименование КАК Наименование,
	|	Слоги.НаименованиеНаРусском КАК НаименованиеНаРусском,
	|	Слоги.ЗаписьХираганой КАК ЗаписьКаной,
	|	СпрМоджи.Наименование КАК МоджиНаименование,
	|	СпрМоджи.ЮникодПредставление КАК МоджиЗаписьКаной,
	|	СпрМоджи.НаименованиеНаРусском КАК МоджиНаименованиеНаРусском
	|ИЗ
	|	Справочник.Слоги.Состав КАК СлогиСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Моджи КАК СпрМоджи
	|		ПО СлогиСостав.Моджи = СпрМоджи.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Слоги КАК Слоги
	|		ПО СлогиСостав.Ссылка = Слоги.Ссылка
	|ГДЕ
	|	Слоги.Наименование В(&СлогиНаименования)
	|	
	|ИТОГИ
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(НаименованиеНаРусском),
	|	МАКСИМУМ(ЗаписьКаной)
	|ПО
	|	Слог";
	
КонецФункции

// Проверяет, является ли символ "сокуоном"
//
// Параметры:
//   Наименование - Строка - Проверяемое наименование слога
//   ЭтоМиниСимвол - Булево - Признак мини-символа
//
// Возвращаемое значение:
//   Булево - Истина, если наименование "Tsu" и это мини-символ
Функция ЭтоСокуон(Наименование, ЭтоМиниСимвол) Экспорт
	
	Возврат Наименование = "Tsu" И ЭтоМиниСимвол;
	
КонецФункции

#КонецОбласти
